{
  "irVersion": "1.0",
  "project": "w3pilot",
  "repository": "https://github.com/plexusone/w3pilot",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.6.0",
      "date": "2026-03-28",
      "highlights": [
        { "description": "AI Agent Ergonomics features for improved agent-browser interaction" },
        { "description": "Page inspection to discover interactive elements without prior knowledge" },
        { "description": "Selector validation with suggestions for alternatives" },
        { "description": "High-level workflow recipes for login and table extraction" },
        { "description": "Named state snapshots for saving and restoring browser state" }
      ],
      "added": [
        { "description": "`Pilot.Inspect()` method to discover buttons, links, inputs, selects, headings, and images on a page" },
        { "description": "`Pilot.ValidateSelectors()` and `Pilot.ValidateSelector()` methods to verify selectors before use" },
        { "description": "`Pilot.Login()` workflow for automated login with credentials and success verification" },
        { "description": "`Pilot.ExtractTable()` workflow to extract HTML table data to structured JSON" },
        { "description": "`state.Manager` for saving and loading named state snapshots to `~/.w3pilot/states/`" },
        { "description": "`page_inspect` MCP tool for AI agents to discover page elements" },
        { "description": "`test_validate_selectors` MCP tool for validating CSS selectors with suggestions" },
        { "description": "`workflow_login` MCP tool for automated login workflow" },
        { "description": "`workflow_extract_table` MCP tool for extracting table data" },
        { "description": "`state_save`, `state_load`, `state_list`, `state_delete` MCP tools for named state management" },
        { "description": "`w3pilot page inspect` CLI command for page inspection" },
        { "description": "`w3pilot test validate-selectors` CLI command for selector validation" },
        { "description": "`w3pilot state save/load/list/delete` CLI commands for state management" },
        { "description": "`--format` / `-o` global CLI flag for JSON output mode" },
        { "description": "`PageContext` struct added to error types for enhanced error context" },
        { "description": "`Suggestions` field added to `ElementNotFoundError` and `TimeoutError`" }
      ],
      "documentation": [
        { "description": "AI Agent Ergonomics guide with inspection, validation, workflows, and state management" },
        { "description": "v0.6.0 release notes" },
        { "description": "Updated MCP tools reference with new tools" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-03-23",
      "highlights": [
        { "description": "Project renamed from vibium-go to w3pilot with new module path and CLI" },
        { "description": "Native Chrome launcher replaces external clicker dependency" },
        { "description": "Video recording and WebSocket monitoring support" },
        { "description": "Page event listeners and accessibility snapshot" }
      ],
      "breaking": [
        { "description": "Module path changed from `github.com/plexusone/vibium-go` to `github.com/plexusone/w3pilot`", "commit": "3e7b47d" },
        { "description": "Package renamed from `vibium` to `w3pilot`", "commit": "3e7b47d" },
        { "description": "Core type renamed from `*Vibe` to `*Pilot`", "commit": "3e7b47d" },
        { "description": "CLI renamed from `vibium` to `w3pilot`, `vibium-mcp` to `w3pilot-mcp`, `vibium-rpa` to `w3pilot-rpa`", "commit": "3422023" },
        { "description": "Environment variables renamed from `VIBIUM_*` to `W3PILOT_*` (DEBUG, HEADLESS, SKIP_BROWSER_DOWNLOAD)", "commit": "658103b" }
      ],
      "added": [
        { "description": "Native Chrome launcher - browser is now bundled and auto-installed, removing need for external clicker binary", "commit": "27c4ce3" },
        { "description": "`Pilot.StartVideo()` and `Pilot.StopVideo()` for video recording of browser sessions", "commit": "27bf163" },
        { "description": "`Pilot.OnWebSocket()` for monitoring WebSocket connections opened by the page", "commit": "3583311" },
        { "description": "Page event listeners: `OnConsole()`, `OnPageError()`, `OnRequest()`, `OnResponse()`, `OnDialog()`", "commit": "484d6c9" },
        { "description": "Event listener infrastructure with `OnEvent()` method on BiDi client", "commit": "250882f" },
        { "description": "`delete_cookie` MCP tool", "commit": "ff8c1f0" },
        { "description": "`wait_for_text` MCP tool", "commit": "ff8c1f0" },
        { "description": "`accessibility_snapshot` MCP tool", "commit": "ff8c1f0" },
        { "description": "Frame selection MCP tools: `list_frames`, `select_frame`", "commit": "b45550b" },
        { "description": "State verification MCP tools: `get_state`, `verify_state`", "commit": "b45550b" },
        { "description": "Assertion MCP tools: `assert_text`, `assert_element`, `assert_url`, `assert_title`", "commit": "736f41d" },
        { "description": "Waiting MCP tools: `wait_for_element`, `wait_for_text`, `wait_for_url`", "commit": "736f41d" },
        { "description": "Low-priority SDK methods for parity with JS/Python clients", "commit": "25bb45e" }
      ],
      "fixed": [
        { "description": "Writable file handle closed without error handling (code scanning alert)", "commit": "8294c13" }
      ],
      "tests": [
        { "description": "Integration tests for verification operations", "commit": "922cb94" },
        { "description": "Integration tests for MCP tools and page methods", "commit": "06a0742" }
      ],
      "documentation": [
        { "description": "VibiumDev vs w3pilot feature comparison", "commit": "418a547" },
        { "description": "Consolidated comparison documentation with Playwright MCP", "commit": "155da81" },
        { "description": "Updated all documentation for w3pilot rename", "commit": "3cef949" },
        { "description": "Updated references from clicker to Chrome native launcher", "commit": "a33e96c" }
      ],
      "infrastructure": [
        { "description": "Update CI/CD workflows for w3pilot rename", "commit": "9c562e4" },
        { "description": "Update cache directories from `vibium` to `w3pilot`", "commit": "658103b" },
        { "description": "Update MCP server name from `vibium-mcp` to `w3pilot-mcp`", "commit": "658103b" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-03-21",
      "highlights": [
        { "description": "Semantic selectors for AI-native element finding by accessibility attributes" },
        { "description": "Full storage state management with sessionStorage support" },
        { "description": "Init scripts for pre-page JavaScript injection" },
        { "description": "25+ new MCP tools for dialogs, network, storage, tabs, and tracing" }
      ],
      "added": [
        { "description": "Semantic selectors: find elements by `role`, `text`, `label`, `placeholder`, `testid`, `alt`, `title`, `xpath`, and `near`", "commit": "131bef9" },
        { "description": "`Vibe.Find()` and `Vibe.FindAll()` now accept `FindOptions` for semantic filtering", "commit": "131bef9" },
        { "description": "`Element.Find()` and `Element.FindAll()` for scoped semantic search within parent elements", "commit": "131bef9" },
        { "description": "MCP tools (`click`, `type`, `fill`, `press`) support semantic selector parameters", "commit": "131bef9" },
        { "description": "`Vibe.AddInitScript()` to inject JavaScript before page scripts on every navigation", "commit": "b7bb6df" },
        { "description": "`add_init_script` MCP tool for runtime script injection", "commit": "b7bb6df" },
        { "description": "`--init-script` CLI flag for `vibium launch` and `vibium mcp` commands", "commit": "b7bb6df" },
        { "description": "`Vibe.StorageState()` now captures sessionStorage in addition to cookies and localStorage", "commit": "d24d54c" },
        { "description": "`Vibe.SetStorageState()` restores complete browser state including sessionStorage", "commit": "d24d54c" },
        { "description": "`Vibe.ClearStorage()` clears all storage types (cookies, localStorage, sessionStorage)", "commit": "d24d54c" },
        { "description": "`clear_storage` MCP tool to clear all browser storage", "commit": "d24d54c" },
        { "description": "MCP tracing tools: `start_trace`, `stop_trace`, `start_trace_chunk`, `stop_trace_chunk`, `start_trace_group`, `stop_trace_group`", "commit": "abf0ed8" },
        { "description": "MCP dialog tools: `handle_dialog`, `get_dialog`", "commit": "f2ffad9" },
        { "description": "MCP network tools: `get_network_requests`, `clear_network_requests`, `route`, `unroute`, `route_list`, `network_state_set`", "commit": "f2ffad9" },
        { "description": "MCP localStorage tools: `localstorage_get`, `localstorage_set`, `localstorage_list`, `localstorage_delete`, `localstorage_clear`", "commit": "f2ffad9" },
        { "description": "MCP sessionStorage tools: `sessionstorage_get`, `sessionstorage_set`, `sessionstorage_list`, `sessionstorage_delete`, `sessionstorage_clear`", "commit": "f2ffad9" },
        { "description": "MCP tab tools: `list_tabs`, `select_tab`, `close_tab`", "commit": "f2ffad9" },
        { "description": "MCP testing tools: `verify_value`, `verify_list_visible`, `generate_locator`, `fill_form`", "commit": "f2ffad9" }
      ],
      "fixed": [
        { "description": "Browser connection drops in MCP server by using `exec.Command` instead of `exec.CommandContext` for clicker process lifetime", "commit": "78f3e4a" }
      ],
      "tests": [
        { "description": "Integration tests for semantic selectors covering all selector types and scoped search", "commit": "4c1b714" },
        { "description": "Integration tests for tracing with chunks and groups", "commit": "4c1b714" },
        { "description": "Integration tests for storage state round-trip and sessionStorage", "commit": "4c1b714" },
        { "description": "Integration tests for init scripts with API mocking", "commit": "4c1b714" }
      ],
      "documentation": [
        { "description": "Semantic selectors section in README and SDK guide with examples", "commit": "7bb3f09" },
        { "description": "Init scripts, storage state, and tracing sections in README", "commit": "8847012" },
        { "description": "MCP tools reference with all new tools documented", "commit": "7bb3f09" },
        { "description": "Feature comparison table with JS/Python clients", "commit": "7bb3f09" }
      ],
      "infrastructure": [
        { "description": "TASKS.md for tracking feature parity with JS/Python clients", "commit": "24d5cdf" },
        { "description": "Update Go module dependencies", "commit": "124cca1" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-03-16",
      "highlights": [
        { "description": "Human-in-the-Loop (HITL) support for SSO login, CAPTCHA, and 2FA workflows" }
      ],
      "added": [
        { "description": "`pause_for_human` MCP tool to pause automation with visual overlay for human intervention", "commit": "2b7c2fc" },
        { "description": "`set_storage_state` MCP tool to restore saved session (cookies + localStorage)", "commit": "2b7c2fc" }
      ],
      "fixed": [
        { "description": "Handle file close errors in RPA file activity", "commit": "50a496a" },
        { "description": "Remove unreachable statement in vibium-mcp main", "commit": "0f9602a" }
      ],
      "documentation": [
        { "description": "Add Human-in-the-Loop guide with workflow diagrams and examples", "commit": "2100cf9" },
        { "description": "Update MCP server docs with HITL tools table", "commit": "2100cf9" },
        { "description": "Update README shields", "commit": "dd1ed49" }
      ],
      "infrastructure": [
        { "description": "Bump `github.com/modelcontextprotocol/go-sdk` from 1.4.0 to 1.4.1", "commit": "5a9afc4" },
        { "description": "Bump `actions/checkout` from 4 to 6", "commit": "0b2047a" },
        { "description": "Bump `actions/setup-go` from 5 to 6", "commit": "f0ddc69" },
        { "description": "Bump `actions/upload-artifact` from 4 to 7", "commit": "1bde2c5" },
        { "description": "Update Go module dependencies", "commit": "3f305d4" }
      ]
    },
    {
      "version": "v0.2.1",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Complete migration to `plexusone` GitHub organization" }
      ],
      "fixed": [
        { "description": "Update all Go imports from `agentplexus` to `plexusone` organization", "commit": "13c030b" },
        { "description": "Fix gofmt formatting issues", "commit": "d6be948" }
      ],
      "infrastructure": [
        { "description": "Migrate CI/CD to organization-level reusable workflows from `plexusone/.github`", "commit": "1eeff28" },
        { "description": "Update CHANGELOG, README, go.mod, and mkdocs.yml for plexusone organization", "commit": "f15b18f" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "RPA workflow engine for YAML-based browser automation scripts" },
        { "description": "Repository migration from `grokify/vibium-go` to `plexusone/vibium-go`" },
        { "description": "Code quality improvements and lint fixes" }
      ],
      "added": [
        { "description": "RPA workflow engine with YAML script execution, variable interpolation, and conditional logic", "commit": "99bb6f2" },
        { "description": "Activity registry with browser, element, form, and data activities", "commit": "99bb6f2" },
        { "description": "`vibium-rpa` CLI for running and validating RPA workflows", "commit": "99bb6f2" }
      ],
      "breaking": [
        { "description": "Module path changed from `github.com/grokify/vibium-go` to `github.com/plexusone/vibium-go`", "commit": "99bb6f2" }
      ],
      "changed": [
        { "description": "Reduced duplication in MCP element handlers with `elementOp` helper function", "commit": "42d1066" }
      ],
      "fixed": [
        { "description": "Handle unchecked errors in RPA executor for browser cleanup and error handler steps", "commit": "d173bec" },
        { "description": "Tighten file permissions from 0644 to 0600 for security (gosec G306)", "commit": "01b295b" },
        { "description": "Fix gofmt formatting in RPA types", "commit": "bc60e9d" }
      ],
      "documentation": [
        { "description": "Add release notes for v0.2.0 and reorganize releases into `docs/releases/`", "commit": "be818e6" },
        { "description": "Update documentation for clicker availability and repo migration", "commit": "0d4fdc5" },
        { "description": "Update README diagram", "commit": "00b65f0" }
      ],
      "infrastructure": [
        { "description": "Make E2E tests manual until clicker binary is distributed", "commit": "43aff3a" },
        { "description": "Suppress false positive lint warnings with nolint directives", "commit": "1924385" },
        { "description": "Fix various golangci-lint issues", "commit": "df9373f" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-31",
      "highlights": [
        { "description": "Go client for Vibium browser automation platform with full feature parity with JavaScript and Python clients" }
      ],
      "added": [
        { "description": "Core types: `BoundingBox`, `ElementInfo`, `LaunchOptions`, `FindOptions`, `ActionOptions`", "commit": "e6ba8d0" },
        { "description": "Custom error types: `ConnectionError`, `TimeoutError`, `ElementNotFoundError`, `BrowserCrashedError`, `BiDiError`", "commit": "e6ba8d0" },
        { "description": "BiDi WebSocket client for browser communication", "commit": "4f73d02" },
        { "description": "Clicker process management with binary discovery via `VIBIUM_CLICKER_PATH`, PATH, and cache directory", "commit": "3f36cf0" },
        { "description": "`Element` type with `Click()`, `Type()`, `Text()`, `GetAttribute()`, `BoundingBox()`, `Center()`, `WaitFor()` methods", "commit": "b33b123" },
        { "description": "`Vibe` browser control with `Launch()`, `Go()`, `Screenshot()`, `Find()`, `Evaluate()`, `Quit()` methods", "commit": "b33b123" },
        { "description": "Debug logging with `slog` via `VIBIUM_DEBUG` environment variable", "commit": "48598c6" },
        { "description": "Navigation methods: `Reload()`, `Back()`, `Forward()`, `WaitForNavigation()`", "commit": "91ad5be" },
        { "description": "`FindAll()` method for finding multiple elements by CSS selector", "commit": "91ad5be" }
      ],
      "changed": [
        { "description": "Environment variable renamed from `HEADLESS` to `VIBIUM_HEADLESS` for consistency", "commit": "a404d5e" }
      ],
      "fixed": [
        { "description": "Format `bidi.go` with gofmt and tighten file permissions to 0600", "commit": "f60f34f" },
        { "description": "`FindAll` parsing to handle BiDi array serialization by returning JSON from JavaScript", "commit": "a839387" },
        { "description": "Relaxed test assertions for example.com content changes", "commit": "a839387" }
      ],
      "tests": [
        { "description": "Example tests with testable examples for documentation", "commit": "5c4aeac" },
        { "description": "Integration tests for `example.com` with page title, element finding, screenshots, and JavaScript evaluation", "commit": "3f184e8" },
        { "description": "Integration tests for `the-internet.herokuapp.com` with dynamic elements, inputs, checkboxes, dropdowns, and navigation", "commit": "3f184e8" }
      ],
      "documentation": [
        { "description": "Package documentation with godoc comments", "commit": "8236d7e" },
        { "description": "README with feature parity table, installation, quick start, and API reference", "commit": "8236d7e" },
        { "description": "Documentation for debug logging, navigation methods, and `FindAll`", "commit": "91fd20f" },
        { "description": "Testing section with unit and integration test instructions", "commit": "84388af" },
        { "description": "Repository badges for build status, lint, Go Report Card, and license", "commit": "df0b67c" }
      ],
      "infrastructure": [
        { "description": "Go module files (`go.mod`, `go.sum`)", "commit": "cb7a6f9" },
        { "description": "Project configuration files", "commit": "1e66b00" }
      ]
    }
  ]
}
